capsproj2026-creator/capstone-project2026/hardware/esp32_rfid_gate_exit/rfid_gate_common.h
/**
 * Shared RFID gate client logic — entry and exit sketches include this file.
 * Actuator control stays on ESP32; Laravel only returns grant/deny decisions.
 *
 * Shared boom: wire the servo to the Entry ESP32 only. Exit uses ACTUATOR_NONE;
 * Laravel queues an open to Entry when Exit RFID is granted.
 *
 * Network: WIFI_SSID / API_HOST from rfid_gate_config.h (WiFiManager portal off by default).
 */
#pragma once

#include <WiFi.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <SPI.h>
#include <MFRC522.h>
#include <Preferences.h>

// Config first so USE_WIFI_MANAGER is known before the WiFiManager include check.
#if __has_include("rfid_gate_config.h")
#include "rfid_gate_config.h"
#else
#error "Copy rfid_gate_config.example.h to rfid_gate_config.h and configure defaults/token."
#endif

#ifndef USE_WIFI_MANAGER
#define USE_WIFI_MANAGER 0
#endif

#if USE_WIFI_MANAGER
// Include directly so Arduino's library scanner adds WiFiManager to the path.
// __has_include(<WiFiManager.h>) is false until that happens, which caused a
// false "WiFiManager required" error even when the library was installed.
#include <WiFiManager.h>
#define GATE_HAS_WIFI_MANAGER 1
#else
#define GATE_HAS_WIFI_MANAGER 0
#endif

#ifndef ACTUATOR_NONE
#define ACTUATOR_NONE 0
#endif
#ifndef ACTUATOR_RELAY
#define ACTUATOR_RELAY 1
#endif
#ifndef ACTUATOR_SERVO
#define ACTUATOR_SERVO 2
#endif
#ifndef ACTUATOR_MODE
#define ACTUATOR_MODE ACTUATOR_SERVO
#endif

#if ACTUATOR_MODE == ACTUATOR_SERVO
#include <ESP32Servo.h>
#endif

#ifndef GATE_OPEN_MS
#define GATE_OPEN_MS 8000UL
#endif
#ifndef GATE_COOLDOWN_MS
// Short gap so a *different* card can be tapped quickly after the previous one.
#define GATE_COOLDOWN_MS 250UL
#endif
#ifndef SAME_UID_COOLDOWN_MS
// Same physical card left on the reader after a completed scan — ignore repeats.
// Measured from AFTER the HTTP round-trip (see lastScanMs refresh below), not before.
#define SAME_UID_COOLDOWN_MS 1800UL
#endif
#ifndef SCAN_BLOCK_MS
// Prevents duplicate boom opens during one grant cycle (not a general "wait to scan").
#define SCAN_BLOCK_MS 800UL
#endif
#ifndef HEARTBEAT_MS
#define HEARTBEAT_MS 1500UL
#endif
#ifndef SERVO_TEST_ON_BOOT
#define SERVO_TEST_ON_BOOT 0
#endif
#ifndef WIFI_CONNECT_TIMEOUT_MS
#define WIFI_CONNECT_TIMEOUT_MS 25000UL
#endif
#ifndef WIFI_RETRY_MAX_MS
#define WIFI_RETRY_MAX_MS 30000UL
#endif
#ifndef HEARTBEAT_FAIL_MAX_MS
#define HEARTBEAT_FAIL_MAX_MS 30000UL
#endif

// Compile-time defaults (overridden by phone portal / NVS when WiFiManager is available).
#ifndef API_HOST
#define API_HOST "127.0.0.1"
#endif
#ifndef API_PORT
#define API_PORT 8000
#endif
#ifndef WIFI_SSID
#define WIFI_SSID ""
#endif
#ifndef WIFI_PASSWORD
#define WIFI_PASSWORD ""
#endif
#ifndef RFID_API_TOKEN
#define RFID_API_TOKEN "capstone-rfid-dev-token-change-me"
#endif
#ifndef WIFI_PORTAL_AP_NAME
#define WIFI_PORTAL_AP_NAME "Gate-Setup"
#endif
#ifndef WIFI_PORTAL_AP_PASS
#define WIFI_PORTAL_AP_PASS "capstone123"
#endif
#ifndef FORCE_CONFIG_PIN
#define FORCE_CONFIG_PIN 0
#endif

#define SS_PIN    5
#define RST_PIN   22
#define SCK_PIN   18
#define MISO_PIN  19
#define MOSI_PIN  23
#define PIN_GREEN 25
#define PIN_RED   26
#define PIN_BUZZER 27
#define PIN_GATE  14

// Tight timeouts so a dead API fails fast; healthy LAN replies well under these.
const uint16_t HTTP_CONNECT_MS = 2500;
const uint16_t HTTP_READ_MS    = 5000;
const uint16_t HTTP_HB_CONNECT_MS = 3000;
const uint16_t HTTP_HB_READ_MS    = 5000;

MFRC522 mfrc522(SS_PIN, RST_PIN);
Preferences gatePrefs;

#if ACTUATOR_MODE == ACTUATOR_SERVO
Servo gateServo;
#endif

// Runtime network target (NVS / portal). Prefer these over compile-time macros in HTTP calls.
String runtimeApiHost = API_HOST;
uint16_t runtimeApiPort = (uint16_t) API_PORT;
String runtimeApiToken = RFID_API_TOKEN;

struct ScanResult {
  bool granted;
  bool openSharedBoom;
  String status;
  String code;
};

unsigned long lastScanMs = 0;
String lastUidHex = "";
unsigned long lastHeartbeatMs = 0;
unsigned long lastWifiRetryMs = 0;
unsigned long wifiRetryDelayMs = 1000UL;
unsigned long heartbeatIntervalMs = HEARTBEAT_MS;
unsigned long gateCycleEndsMs = 0;
unsigned long gateCloseAtMs = 0;
unsigned long lastRfidRecoverMs = 0;
unsigned long forceConfigHoldStartMs = 0;
bool gateIsOpen = false;
bool apiOnline = false;
bool rfidOk = false;
bool portalBusy = false;
int apiFailStreak = 0;
unsigned long lastLanDiagMs = 0;

String uidToHex(MFRC522::Uid &uid);
ScanResult postScan(const String &uid);
bool pollHeartbeat();
void logLanDiagnostic();
void handleResult(const ScanResult &result, bool forceOpen = false);
void grantAccess();
void denyAccess(const ScanResult &result);
void openGateActuator();
void closeGateActuator();
void updateGateCycle();
void initGateActuator();
bool ensureWifiConnected();
void connectWifiStartup();
void printWifiFailureHelp();
bool initRfidReader();
void recoverRfidIfNeeded();
void loadNetworkPrefs();
void saveNetworkPrefs();
String runtimeApiBase();
bool wifiManagerEnabled();
bool forceConfigRequested();
void startWifiConfigPortal(bool force = false);
void pollForceConfigButton();

String runtimeApiBase() {
  return String("http://") + runtimeApiHost + ":" + String(runtimeApiPort);
}

bool wifiManagerEnabled() {
#if GATE_HAS_WIFI_MANAGER && USE_WIFI_MANAGER
  return true;
#else
  return false;
#endif
}

void loadNetworkPrefs() {
  // Always start from rfid_gate_config.h.
  runtimeApiHost = API_HOST;
  runtimeApiPort = (uint16_t) API_PORT;
  runtimeApiToken = RFID_API_TOKEN;

  // When WiFiManager is off, ignore stale NVS from old portal saves
  // (that is why boards kept calling 192.168.1.74 after reflash).
  if (!wifiManagerEnabled()) {
    // Clear old portal values so a later enable does not resurrect them.
    if (gatePrefs.begin("gate", false)) {
      gatePrefs.clear();
      gatePrefs.end();
    }
    Serial.printf("API from config: %s\n", runtimeApiBase().c_str());
    return;
  }

  if (!gatePrefs.begin("gate", true)) {
    return;
  }
  String host = gatePrefs.getString("api_host", "");
  uint16_t port = (uint16_t) gatePrefs.getUShort("api_port", 0);
  String token = gatePrefs.getString("api_token", "");
  gatePrefs.end();

