capsproj2026-creator/capstone-project2026/hardware/esp32_rfid_gate_exit/rfid_gate_common.h
  if (host.length() > 0) {
    runtimeApiHost = host;
  }
  if (port > 0) {
    runtimeApiPort = port;
  }
  if (token.length() > 0) {
    runtimeApiToken = token;
  }
}

void saveNetworkPrefs() {
  if (!gatePrefs.begin("gate", false)) {
    Serial.println("NVS: failed to open gate prefs for write");
    return;
  }
  gatePrefs.putString("api_host", runtimeApiHost);
  gatePrefs.putUShort("api_port", runtimeApiPort);
  gatePrefs.putString("api_token", runtimeApiToken);
  gatePrefs.end();
  Serial.printf("NVS saved API %s:%u\n", runtimeApiHost.c_str(), runtimeApiPort);
}

bool forceConfigRequested() {
  pinMode(FORCE_CONFIG_PIN, INPUT_PULLUP);
  delay(20);
  if (digitalRead(FORCE_CONFIG_PIN) != LOW) {
    return false;
  }
  Serial.println("BOOT held — wait 2s to open Wi-Fi / API setup portal...");
  unsigned long start = millis();
  while (digitalRead(FORCE_CONFIG_PIN) == LOW) {
    if (millis() - start >= 2000UL) {
      return true;
    }
    delay(20);
  }
  return false;
}

#if GATE_HAS_WIFI_MANAGER && USE_WIFI_MANAGER
void startWifiConfigPortal(bool force) {
  portalBusy = true;
  WiFiManager wm;
  wm.setConfigPortalTimeout(180);
  wm.setConnectTimeout(25);
  wm.setTitle("Capstone Gate Setup");
  wm.setWiFiAutoReconnect(true);
  // Open portal automatically if saved/preloaded Wi-Fi fails to connect.
  wm.setEnableConfigPortal(true);
  wm.setConfigPortalBlocking(true);

  // Seed portal / first connect from rfid_gate_config.h (overridden when user saves in portal).
  if (String(WIFI_SSID).length() > 0) {
    wm.preloadWiFi(String(WIFI_SSID), String(WIFI_PASSWORD));
  }

  char hostBuf[48];
  char portBuf[8];
  char tokenBuf[80];
  snprintf(hostBuf, sizeof(hostBuf), "%s", runtimeApiHost.c_str());
  snprintf(portBuf, sizeof(portBuf), "%u", runtimeApiPort);
  snprintf(tokenBuf, sizeof(tokenBuf), "%s", runtimeApiToken.c_str());

  WiFiManagerParameter pHost("api_host", "Laravel PC IP (ipconfig)", hostBuf, 47);
  WiFiManagerParameter pPort("api_port", "Laravel port", portBuf, 7);
  WiFiManagerParameter pToken("api_token", "RFID API token (same as .env)", tokenBuf, 79);
  wm.addParameter(&pHost);
  wm.addParameter(&pPort);
  wm.addParameter(&pToken);

  wm.setSaveParamsCallback([&]() {
    String host = String(pHost.getValue());
    host.trim();
    if (host.length() > 0) {
      runtimeApiHost = host;
    }
    int port = atoi(pPort.getValue());
    if (port > 0 && port < 65536) {
      runtimeApiPort = (uint16_t) port;
    }
    String token = String(pToken.getValue());
    token.trim();
    if (token.length() > 0) {
      runtimeApiToken = token;
    }
    saveNetworkPrefs();
  });

  Serial.println();
  Serial.println("=== Gate Wi-Fi / API portal (WiFiManager) ===");
  Serial.printf("1) On phone join Wi-Fi AP: %s  password: %s\n", WIFI_PORTAL_AP_NAME, WIFI_PORTAL_AP_PASS);
  Serial.println("2) Browser opens setup (or go to http://192.168.4.1)");
  Serial.println("3) Pick this location's 2.4 GHz Wi-Fi + Laravel PC IP + token");
  Serial.printf("   Default API target: %s\n", runtimeApiBase().c_str());
  if (String(WIFI_SSID).length() > 0) {
    Serial.printf("   Preloaded SSID from config: %s\n", WIFI_SSID);
  }
  Serial.println("==============================");

  bool ok = false;
  if (force) {
    ok = wm.startConfigPortal(WIFI_PORTAL_AP_NAME, WIFI_PORTAL_AP_PASS);
  } else {
    ok = wm.autoConnect(WIFI_PORTAL_AP_NAME, WIFI_PORTAL_AP_PASS);
  }

  // Always re-read custom params after portal closes (save callback may not fire on all paths).
  String host = String(pHost.getValue());
  host.trim();
  if (host.length() > 0) {
    runtimeApiHost = host;
  }
  int port = atoi(pPort.getValue());
  if (port > 0 && port < 65536) {
    runtimeApiPort = (uint16_t) port;
  }
  String token = String(pToken.getValue());
  token.trim();
  if (token.length() > 0) {
    runtimeApiToken = token;
  }
  saveNetworkPrefs();

  portalBusy = false;
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.setSleep(false);

  if (ok || WiFi.status() == WL_CONNECTED) {
    Serial.print("WiFi OK IP: ");
    Serial.println(WiFi.localIP());
    Serial.printf("API target: %s\n", runtimeApiBase().c_str());
  } else {
    Serial.println("Portal finished without Wi-Fi — will keep retrying.");
  }
}
#else
void startWifiConfigPortal(bool force) {
  (void) force;
  Serial.println("WiFiManager disabled (USE_WIFI_MANAGER 0). Using WIFI_SSID from rfid_gate_config.h only.");
}
#endif

void pollForceConfigButton() {
  if (portalBusy || !wifiManagerEnabled()) {
    return;
  }
  if (digitalRead(FORCE_CONFIG_PIN) == LOW) {
    if (forceConfigHoldStartMs == 0) {
      forceConfigHoldStartMs = millis();
    } else if (millis() - forceConfigHoldStartMs >= 3000UL) {
      Serial.println("BOOT held 3s — opening setup portal...");
      forceConfigHoldStartMs = 0;
      startWifiConfigPortal(true);
    }
  } else {
    forceConfigHoldStartMs = 0;
  }
}

void logLanDiagnostic() {
  if (millis() - lastLanDiagMs < 15000UL) {
    return;
  }
  lastLanDiagMs = millis();

  Serial.printf("LAN check: ESP32=%s -> %s:%u\n",
                WiFi.localIP().toString().c_str(), runtimeApiHost.c_str(), runtimeApiPort);

  WiFiClient probe;
  bool tcpOk = probe.connect(runtimeApiHost.c_str(), runtimeApiPort, 5000);
  Serial.printf("TCP probe %s:%u = %s\n", runtimeApiHost.c_str(), runtimeApiPort, tcpOk ? "OK" : "FAIL");
  if (tcpOk) {
    probe.stop();
    Serial.println("TCP to PC is OK. Heartbeat HTTP will retry (keep Laravel/start.ps1 open).");
  } else {
    Serial.println("PC unreachable from ESP32. On the PC run allow-laravel-firewall.bat (Admin).");
    Serial.printf("On phone (same Wi-Fi) open: http://%s:%u\n", runtimeApiHost.c_str(), runtimeApiPort);
    Serial.println("If phone fails too: disable router AP isolation / guest Wi-Fi.");
    Serial.println("Wrong network? Edit WIFI_SSID / API_HOST in rfid_gate_config.h and re-flash.");
  }
}

void printWifiFailureHelp() {
  wl_status_t st = WiFi.status();
  Serial.print("WiFi status code: ");
  Serial.println((int)st);
  switch (st) {
    case WL_NO_SSID_AVAIL:
      Serial.println("WiFi: SSID not found — check WIFI_SSID in rfid_gate_config.h (2.4 GHz only).");
      break;
    case WL_CONNECT_FAILED:
      Serial.println("WiFi: password rejected — check WIFI_PASSWORD in rfid_gate_config.h.");
      break;
    case WL_DISCONNECTED:
      Serial.println("WiFi: still disconnected — router may be off or out of range.");
      break;
    default:
      Serial.println("WiFi: not connected yet.");
      break;
  }

  // Fresh STA mode before scan (scan after a failed begin() often returns 0 otherwise).
  WiFi.persistent(false);
  WiFi.disconnect(true, true);
  delay(200);
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  delay(100);

  Serial.println("Scanning nearby Wi-Fi (async, ~6s)...");
  WiFi.scanDelete();
  int found = WiFi.scanNetworks(/*async=*/false, /*show_hidden=*/true);
  if (found == WIFI_SCAN_FAILED) {
    Serial.println("  Scan failed — power-cycle ESP32 and check antenna connector.");
    return;
  }
  if (found <= 0) {
    Serial.println("  (no networks seen)");
    Serial.println("  Checklist:");
    Serial.println("   1) ESP32 is 2.4 GHz only — enable 2.4 GHz on the router (or use a mixed SSID).");
    Serial.println("   2) External antenna screwed onto the board (IPEX/u.FL) if your module needs one.");
    Serial.println("   3) Move closer to the router; avoid metal boxes.");
    Serial.println("   4) Edit WIFI_SSID / WIFI_PASSWORD in rfid_gate_config.h and re-flash.");
    return;
  }
  String want = String(WIFI_SSID);
  for (int i = 0; i < found && i < 12; i++) {
    String name = WiFi.SSID(i);
    Serial.printf("  [%d] %s (%d dBm)", i + 1, name.c_str(), WiFi.RSSI(i));
    if (want.length() > 0 && name == want) {
      Serial.print("  <-- matches WIFI_SSID default");
    }
    Serial.println();
  }
  WiFi.scanDelete();
}

void connectWifiStartup() {
  loadNetworkPrefs();
  pinMode(FORCE_CONFIG_PIN, INPUT_PULLUP);

  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);
  WiFi.setSleep(false);

  bool forcePortal = forceConfigRequested();

  if (wifiManagerEnabled()) {
    if (forcePortal) {
      Serial.println("Forced setup portal (BOOT held at power-on).");
      startWifiConfigPortal(true);
    } else {
      Serial.println("WiFiManager: connecting with saved credentials (or opening Gate-Setup portal)...");
      startWifiConfigPortal(false);
    }
    return;
  }

  Serial.println("Using WIFI_SSID / WIFI_PASSWORD from rfid_gate_config.h (no portal).");

  // Compile-time Wi-Fi from rfid_gate_config.h.
  if (String(WIFI_SSID).length() == 0) {
    Serial.println("ERROR: WIFI_SSID empty. Set it in rfid_gate_config.h and re-flash.");
    return;
  }

  WiFi.disconnect(true, true);
  delay(300);
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  Serial.printf("Connecting WiFi SSID=\"%s\" ...", WIFI_SSID);
  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < WIFI_CONNECT_TIMEOUT_MS) {
    delay(400);
    Serial.print(".");
  }
  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    Serial.print("WiFi OK IP: ");
    Serial.println(WiFi.localIP());
    Serial.printf("API target: %s\n", runtimeApiBase().c_str());
  } else {
    Serial.println("WiFi not ready yet — will keep retrying in loop (no BOOT button needed).");
    printWifiFailureHelp();
    // Resume STA connect after diagnostic scan.
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  }
}

