capsproj2026-creator/capstone-project2026/hardware/esp32_rfid_gate_exit/rfid_gate_common.h
bool ensureWifiConnected() {
  if (portalBusy) {
    return false;
  }

  if (WiFi.status() == WL_CONNECTED) {
    wifiRetryDelayMs = 1000UL;
    return true;
  }

  if (millis() - lastWifiRetryMs < wifiRetryDelayMs) {
    return false;
  }

  lastWifiRetryMs = millis();
  Serial.println("WiFi lost — reconnecting...");

  if (wifiManagerEnabled()) {
    WiFi.reconnect();
  } else {
    WiFi.disconnect();
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  }

  if (wifiRetryDelayMs < WIFI_RETRY_MAX_MS) {
    wifiRetryDelayMs = min(wifiRetryDelayMs * 2UL, WIFI_RETRY_MAX_MS);
  }

  // After several failures, open portal so user can switch to home/hotspot/campus.
  static int wifiFailStreak = 0;
  wifiFailStreak++;
  if (wifiManagerEnabled() && wifiFailStreak >= 6) {
    wifiFailStreak = 0;
    Serial.println("WiFi still down — opening Gate-Setup portal.");
    startWifiConfigPortal(true);
  }
  if (WiFi.status() == WL_CONNECTED) {
    wifiFailStreak = 0;
  }
  return false;
}

void initGateActuator() {
#if ACTUATOR_MODE == ACTUATOR_SERVO
  // Reserve LEDC timers before attach (attach=0 means no timer/channel — common on ESP32 core 3.x).
  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);

  gateServo.setPeriodHertz(50);
  // attach() may return 0 on success (LEDC channel 0). Use attached() — 0 is not a failure.
  int channel = gateServo.attach(PIN_GATE, 500, 2400);
  if (!gateServo.attached()) {
    Serial.println("Servo attach failed on GPIO 14 — retrying simple attach...");
    channel = gateServo.attach(PIN_GATE);
  }
  bool ok = gateServo.attached();
  Serial.printf("Actuator: SERVO on GPIO %d (channel=%d attached=%d) — shared boom for Entry+Exit\n", PIN_GATE, channel, ok ? 1 : 0);
  if (!ok) {
    Serial.println("WARNING: Servo not attached. Update ESP32Servo library (3.x for Arduino ESP32 3.x).");
    Serial.println("         Check signal on GPIO 14 + external 5V + common GND.");
  }
  delay(200);
  if (ok) {
    gateServo.write(SERVO_CLOSE_ANGLE);
    Serial.printf("Servo -> close angle %d\n", SERVO_CLOSE_ANGLE);
  }
  delay(500);

#if SERVO_TEST_ON_BOOT
  Serial.println("Servo boot test: open...");
  gateServo.write(SERVO_OPEN_ANGLE);
  delay(1200);
  Serial.println("Servo boot test: close...");
  gateServo.write(SERVO_CLOSE_ANGLE);
  delay(800);
  Serial.println("Servo boot test done. If arm did not move, check 5V supply + common GND + signal on GPIO 14.");
#endif
#elif ACTUATOR_MODE == ACTUATOR_RELAY
  pinMode(PIN_GATE, OUTPUT);
  digitalWrite(PIN_GATE, LOW);
  Serial.println("Actuator: RELAY");
#else
  Serial.println("Actuator: NONE (RFID only — shared boom is on Entry ESP32)");
#endif
}

bool initRfidReader() {
  // Hard reset pulse on RST — fixes many "online but no UID" boards after bad power-up.
  pinMode(RST_PIN, OUTPUT);
  pinMode(SS_PIN, OUTPUT);
  digitalWrite(SS_PIN, HIGH);
  digitalWrite(RST_PIN, LOW);
  delay(50);
  digitalWrite(RST_PIN, HIGH);
  delay(50);

  SPI.begin(SCK_PIN, MISO_PIN, MOSI_PIN, SS_PIN);
  mfrc522.PCD_Init();
  delay(50);
  mfrc522.PCD_AntennaOn();
  mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);

  byte v = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
  Serial.printf("RC522 VersionReg=0x%02X ", v);
  if (v == 0x00 || v == 0xFF) {
    Serial.println("- NOT DETECTED. Wiring checklist:");
    Serial.println("  3.3V->3.3V (NOT 5V)  GND->GND");
    Serial.println("  SDA/SS->GPIO5  SCK->18  MOSI->23  MISO->19  RST->22");
    rfidOk = false;
    return false;
  }

  Serial.println("- OK (reader found). Hold card ~1-2 cm over the antenna coil.");
  Serial.println("Wiring map: SS=5 RST=22 SCK=18 MOSI=23 MISO=19 | LED G=25 R=26 Buzzer=27 | Servo=14(Entry only)");
  rfidOk = true;
  return true;
}

void recoverRfidIfNeeded() {
  if (rfidOk) {
    return;
  }
  if (millis() - lastRfidRecoverMs < 8000UL) {
    return;
  }
  lastRfidRecoverMs = millis();
  Serial.println("RC522 retry init...");
  initRfidReader();
}

void setupGateHardware() {
  pinMode(PIN_GREEN, OUTPUT);
  pinMode(PIN_RED, OUTPUT);
  pinMode(PIN_BUZZER, OUTPUT);
  digitalWrite(PIN_GREEN, LOW);
  digitalWrite(PIN_RED, LOW);
  digitalWrite(PIN_BUZZER, LOW);

  initGateActuator();
  initRfidReader();
  connectWifiStartup();

  lastHeartbeatMs = millis();
  Serial.printf("Gate %s (%s) ready — power-on auto-start enabled.\n", GATE_ID, DIRECTION);
  Serial.printf("API target: %s\n", runtimeApiBase().c_str());
#if defined(GATE_ID) && defined(DIRECTION)
  if (String(GATE_ID) == "GATE-IN-1") {
    Serial.println("ROLE: ENTRY — RC522 + servo GPIO 14. Opens boom for Entry scans and Exit grants.");
  } else if (String(GATE_ID) == "GATE-OUT-1") {
    Serial.println("ROLE: EXIT — RC522 only. No servo. Laravel tells Entry ESP32 to open the boom.");
  }
#endif
  Serial.println("Normal use: power only. Wi-Fi/API come from rfid_gate_config.h.");
}

void loopGateClient() {
  pollForceConfigButton();
  updateGateCycle();
  recoverRfidIfNeeded();

  // Keep heartbeats only when Wi-Fi is up — still poll RFID even if Wi-Fi drops
  // so Serial shows UID for wiring tests.
  bool wifiOk = ensureWifiConnected();
  if (wifiOk && millis() - lastHeartbeatMs >= heartbeatIntervalMs) {
    lastHeartbeatMs = millis();
    if (pollHeartbeat()) {
      heartbeatIntervalMs = HEARTBEAT_MS;
      if (!apiOnline) {
        apiOnline = true;
        Serial.println("API online — heartbeats OK");
      }
    } else {
      apiOnline = false;
      heartbeatIntervalMs = min(heartbeatIntervalMs + 2000UL, HEARTBEAT_FAIL_MAX_MS);
    }
  }

  if (!rfidOk) {
    return;
  }

  // MFRC522 often needs two presence checks before a stable serial read.
  if (!mfrc522.PICC_IsNewCardPresent()) {
    return;
  }
  if (!mfrc522.PICC_ReadCardSerial()) {
    // Second presence + read attempt (common RC522 quirk).
    if (!mfrc522.PICC_IsNewCardPresent() || !mfrc522.PICC_ReadCardSerial()) {
      return;
    }
  }

  String uid = uidToHex(mfrc522.uid);

  // Same card held on reader → short ignore. Different card → ready almost immediately.
  const unsigned long gap = millis() - lastScanMs;
  const bool sameCard = (lastUidHex.length() > 0 && uid.equalsIgnoreCase(lastUidHex));
  const unsigned long needMs = sameCard ? SAME_UID_COOLDOWN_MS : GATE_COOLDOWN_MS;
  if (gap < needMs) {
    mfrc522.PICC_HaltA();
    mfrc522.PCD_StopCrypto1();
    return;
  }
  lastScanMs = millis();
  lastUidHex = uid;

  Serial.print("UID: ");
  Serial.println(uid);

  // Brief green blink = card was read locally (even before Laravel reply).
  digitalWrite(PIN_GREEN, HIGH);
  delay(20);
  digitalWrite(PIN_GREEN, LOW);

  if (!wifiOk) {
    Serial.println("WiFi down — UID seen but not sent. Check WIFI_SSID in rfid_gate_config.h.");
    mfrc522.PICC_HaltA();
    mfrc522.PCD_StopCrypto1();
    return;
  }

