capsproj2026-creator/capstone-project2026/hardware/esp32_rfid_gate_exit/rfid_gate_common.h
  ScanResult result = postScan(uid);
  // Cooldown must start AFTER the HTTP round-trip. If we only stamped lastScanMs
  // before POST, a 1–2s Laravel reply already exhausts SAME_UID_COOLDOWN_MS and
  // the still-held card immediately fires a second scan (double profile on the
  // live gate monitor: Access Granted, then Already Inside).
  lastScanMs = millis();
  Serial.printf("Decision: granted=%d shared_boom=%d status=%s code=%s\n",
                result.granted, result.openSharedBoom, result.status.c_str(), result.code.c_str());
  handleResult(result);

  mfrc522.PICC_HaltA();
  mfrc522.PCD_StopCrypto1();
}

String uidToHex(MFRC522::Uid &uid) {
  String out = "";
  for (byte i = 0; i < uid.size; i++) {
    if (uid.uidByte[i] < 0x10) out += "0";
    out += String(uid.uidByte[i], HEX);
  }
  out.toUpperCase();
  return out;
}

ScanResult postScan(const String &uid) {
  ScanResult fail = {false, false, "Access Denied", "network_error"};

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("HTTP skipped: WiFi disconnected");
    return fail;
  }

  WiFiClient client;
  // Do not call client.setTimeout() here — on ESP32 core 3.x it is milliseconds,
  // and a small value (e.g. 5) causes HTTPC_ERROR_READ_TIMEOUT (-11).

  HTTPClient http;
  http.setReuse(false);
  Serial.printf("POST http://%s:%u/api/rfid/scan\n", runtimeApiHost.c_str(), runtimeApiPort);

  if (!http.begin(client, runtimeApiHost.c_str(), runtimeApiPort, "/api/rfid/scan")) {
    Serial.println("HTTP error: unable to initialize connection");
    return fail;
  }

  http.addHeader("Content-Type", "application/json");
  http.addHeader("Connection", "close");
  http.addHeader("X-RFID-TOKEN", runtimeApiToken.c_str());
  http.setConnectTimeout(HTTP_CONNECT_MS);
  http.setTimeout(HTTP_READ_MS);

  StaticJsonDocument<256> body;
  body["uid"] = uid;
  body["gate_id"] = GATE_ID;
  body["direction"] = DIRECTION;

  String payload;
  serializeJson(body, payload);

  int code = http.POST(payload);

  if (code <= 0) {
    Serial.printf("HTTP failed (%d): %s\n", code, HTTPClient::errorToString(code).c_str());
    http.end();
    return fail;
  }

  String response = http.getString();
  http.end();
  Serial.printf("HTTP %d: %s\n", code, response.c_str());

  StaticJsonDocument<768> doc;
  if (deserializeJson(doc, response)) {
    Serial.println("JSON parse error");
    return fail;
  }

  ScanResult result;
  result.granted = doc["granted"] | false;
  result.openSharedBoom = doc["open_shared_boom"] | false;
  result.status = String((const char*)(doc["status"] | "Access Denied"));
  result.code = String((const char*)(doc["code"] | "access_denied"));
  return result;
}

bool pollHeartbeat() {
  WiFiClient client;
  // Avoid client.setTimeout(5) — that is 5ms on many ESP32 cores → error -11.

  HTTPClient http;
  http.setReuse(false);
  if (!http.begin(client, runtimeApiHost.c_str(), runtimeApiPort, "/api/rfid/heartbeat")) {
    Serial.println("Heartbeat: begin failed");
    return false;
  }

  http.addHeader("Content-Type", "application/json");
  http.addHeader("Connection", "close");
  http.addHeader("X-RFID-TOKEN", runtimeApiToken.c_str());
  http.setConnectTimeout(HTTP_HB_CONNECT_MS);
  http.setTimeout(HTTP_HB_READ_MS);

  StaticJsonDocument<128> body;
  body["gate_id"] = GATE_ID;
  String payload;
  serializeJson(body, payload);

  int code = http.POST(payload);
  if (code <= 0) {
    apiFailStreak++;
    Serial.printf("Heartbeat: HTTP error %d (%s) — server %s:%d\n",
                  code, HTTPClient::errorToString(code).c_str(), runtimeApiHost.c_str(), runtimeApiPort);
    if (apiFailStreak >= 2) {
      logLanDiagnostic();
    }
    http.end();
    return false;
  }

  apiFailStreak = 0;
  String response = http.getString();
  http.end();

  if (code != 200) {
    Serial.printf("Heartbeat: status %d body=%s\n", code, response.c_str());
    return false;
  }

  // Robust parse — ArduinoJson | operator + plain-text fallback.
  bool openCmd = false;
  StaticJsonDocument<384> doc;
  DeserializationError err = deserializeJson(doc, response);
  if (!err) {
    openCmd = doc["open"] | false;
    if (!openCmd && doc.containsKey("command")) {
      const char* cmd = doc["command"] | "";
      openCmd = (strcmp(cmd, "open") == 0);
    }
  } else {
    Serial.printf("Heartbeat: JSON parse fail (%s) body=%s\n", err.c_str(), response.c_str());
  }
  if (!openCmd) {
    openCmd = response.indexOf("\"open\":true") >= 0
      || response.indexOf("\"open\": true") >= 0
      || response.indexOf("\"command\":\"open\"") >= 0;
  }

  if (!openCmd) {
    return true;
  }

  Serial.printf("Heartbeat: OPEN command — %s\n", response.c_str());
  // Drive servo directly (do not depend on ScanResult / RFID debounce).
  digitalWrite(PIN_RED, LOW);
  digitalWrite(PIN_GREEN, HIGH);
  openGateActuator();
  gateIsOpen = true;
  gateCloseAtMs = millis() + GATE_OPEN_MS;
  gateCycleEndsMs = millis() + SCAN_BLOCK_MS;
  Serial.println("Servo OPEN — Entry scan, Exit scan, or emergency (one boom on this board)");
  return true;
}

void handleResult(const ScanResult &result, bool forceOpen) {
  if (result.granted) {
    // RFID debounce only — emergency/shared-boom heartbeat must always move the servo.
    if (!forceOpen && (gateIsOpen || millis() < gateCycleEndsMs)) {
      Serial.println("Gate cycle active — ignoring duplicate RFID open");
      digitalWrite(PIN_GREEN, HIGH);
      delay(80);
      digitalWrite(PIN_GREEN, LOW);
      return;
    }
    grantAccess();
    if (result.openSharedBoom) {
      Serial.println("Laravel queued OPEN on Entry ESP32 (GATE-IN-1). Servo moves there in ~1-2s.");
    }
    return;
  }
  denyAccess(result);
}

void grantAccess() {
  digitalWrite(PIN_RED, LOW);
  digitalWrite(PIN_GREEN, HIGH);
  openGateActuator();
  gateIsOpen = true;
  gateCloseAtMs = millis() + GATE_OPEN_MS;
  gateCycleEndsMs = millis() + SCAN_BLOCK_MS;
#if ACTUATOR_MODE == ACTUATOR_NONE
  Serial.println("Access Granted (Exit) — keep Entry ESP32 + Laravel on; servo opens on Entry in ~1-2s");
#else
  Serial.println("Access Granted (Entry) — servo opening on this board");
#endif
}

