capsproj2026-creator/capstone-project2026/hardware/esp32_rfid_gate_exit/rfid_gate_common.h
void denyAccess(const ScanResult &result) {
  digitalWrite(PIN_GREEN, LOW);
  closeGateActuator();
  gateCloseAtMs = 0;

  digitalWrite(PIN_RED, HIGH);

  int pulses = 3;
  if (result.code == "already_inside" || result.code == "already_outside") {
    pulses = 2;
  } else if (result.code == "card_not_registered") {
    pulses = 5;
  }

  for (int i = 0; i < pulses; i++) {
    digitalWrite(PIN_BUZZER, HIGH);
    delay(80);
    digitalWrite(PIN_BUZZER, LOW);
    delay(50);
  }
  delay(150);
  digitalWrite(PIN_RED, LOW);
  Serial.printf("Denied (%s)\n", result.code.c_str());
  if (result.code == "already_inside") {
    Serial.println("HINT: This card is already INSIDE. Tap it on the EXIT ESP32 (Exit.ino / GATE-OUT-1), not Entry.");
  } else if (result.code == "already_outside") {
    Serial.println("HINT: Tap this card on ENTRY first, then on EXIT. Exit is denied until there is an Entry log.");
  } else if (result.code == "card_not_registered") {
    Serial.println("HINT: Admin -> RFID Assignment -> set UID to this card.");
  } else if (result.code == "network_error") {
    Serial.println("HINT: Exit board must use the same WIFI_SSID + API_HOST as Entry in rfid_gate_config.h.");
  }
}

void openGateActuator() {
#if ACTUATOR_MODE == ACTUATOR_SERVO
  if (!gateServo.attached()) {
    Serial.println("Servo OPEN skipped — not attached (see boot log channel=0)");
    return;
  }
  Serial.printf("Servo OPEN -> %d deg\n", SERVO_OPEN_ANGLE);
  gateServo.write(SERVO_OPEN_ANGLE);
#elif ACTUATOR_MODE == ACTUATOR_RELAY
  digitalWrite(PIN_GATE, HIGH);
#else
  Serial.println("No local servo (Exit board). Laravel will open the Entry ESP32 servo.");
#endif
}

void closeGateActuator() {
#if ACTUATOR_MODE == ACTUATOR_SERVO
  if (gateServo.attached()) {
    Serial.printf("Servo CLOSE -> %d deg\n", SERVO_CLOSE_ANGLE);
    gateServo.write(SERVO_CLOSE_ANGLE);
  }
#elif ACTUATOR_MODE == ACTUATOR_RELAY
  digitalWrite(PIN_GATE, LOW);
#endif
  gateIsOpen = false;
}

void updateGateCycle() {
  if (!gateIsOpen || gateCloseAtMs == 0) {
    return;
  }

  if (millis() >= gateCloseAtMs) {
    closeGateActuator();
    digitalWrite(PIN_GREEN, LOW);
    gateCloseAtMs = 0;
    Serial.println("Gate closed");
  }
}
